espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25a111f1152im56.h
/** Part number */

/* If part number is not defined as compiler option, define it */
#if !defined(EFR32FG25A111F1152IM56)
#define EFR32FG25A111F1152IM56    1 /**< FULL Part */
#endif

/** Configure part number */
#define PART_NUMBER                                        "EFR32FG25A111F1152IM56" /**< Part Number */

/** Family / Line / Series / Config */
#define _EFR32_FLEX_FAMILY                                 1                                    /** Device Family Name Identifier */
#define _EFR32_FG_FAMILY                                   1                                    /** Device Family Identifier */
#define _EFR_DEVICE                                        1                                    /** Product Line Identifier */
#define _SILICON_LABS_32B_SERIES_2                                                              /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES                           2                                    /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG_5                                                     /** Product Config Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG                  5                                    /** Product Config Identifier */
#define _SILICON_LABS_GECKO_INTERNAL_SDID                  220                                  /** Silicon Labs internal use only */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_220                                                   /** Silicon Labs internal use only */
#define _SILICON_LABS_SECURITY_FEATURE_SE                  0                                    /** Mid */
#define _SILICON_LABS_SECURITY_FEATURE_VAULT               1                                    /** High */
#define _SILICON_LABS_SECURITY_FEATURE_ROT                 2                                    /** Root Of Trust */
#define _SILICON_LABS_SECURITY_FEATURE                     _SILICON_LABS_SECURITY_FEATURE_SE    /** Security feature set */
#define _SILICON_LABS_DCDC_FEATURE_NOTUSED                 0                                    /** Not Used */
#define _SILICON_LABS_DCDC_FEATURE_DCDC_BUCK               1                                    /** Includes Buck DCDC */
#define _SILICON_LABS_DCDC_FEATURE_DCDC_BOOST              2                                    /** Includes Boost DCDC */
#define _SILICON_LABS_DCDC_FEATURE_DCDC_BOB                3                                    /** Includes Buck or Boost DCDC */
#define _SILICON_LABS_DCDC_FEATURE                         _SILICON_LABS_DCDC_FEATURE_DCDC_BUCK /** DCDC feature set */
#define _SILICON_LABS_EFR32_RADIO_NONE                     0                                    /** No radio present */
#define _SILICON_LABS_EFR32_RADIO_SUBGHZ                   1                                    /** Radio supports Sub-GHz */
#define _SILICON_LABS_EFR32_RADIO_2G4HZ                    2                                    /** Radio supports 2.4 GHz */
#define _SILICON_LABS_EFR32_RADIO_DUALBAND                 3                                    /** Radio supports dual band */
#define _SILICON_LABS_EFR32_RADIO_TYPE                     _SILICON_LABS_EFR32_RADIO_SUBGHZ     /** Radio type */
#define _SILICON_LABS_EFR32_SUBGHZ_HP_PA_MAX_OUTPUT_DBM    16                                   /** Radio SUBGHZ HP PA output power */
#define _SILICON_LABS_EFR32_SUBGHZ_HP_PA_PRESENT                                                /** Radio SUBGHZ HP PA is present */

/** Memory Base addresses and limits */
#define FLASH_MEM_BASE                                     (0x08000000UL) /** FLASH_MEM base address */
#define FLASH_MEM_SIZE                                     (0x001E0000UL) /** FLASH_MEM available address space */
#define FLASH_MEM_END                                      (0x081DFFFFUL) /** FLASH_MEM end address */
#define FLASH_MEM_BITS                                     (0x15UL)       /** FLASH_MEM used bits */
#define MSC_FLASH_MEM_BASE                                 (0x08000000UL) /** MSC_FLASH_MEM base address */
#define MSC_FLASH_MEM_SIZE                                 (0x001E0000UL) /** MSC_FLASH_MEM available address space */
#define MSC_FLASH_MEM_END                                  (0x081DFFFFUL) /** MSC_FLASH_MEM end address */
#define MSC_FLASH_MEM_BITS                                 (0x15UL)       /** MSC_FLASH_MEM used bits */
#define MSC_FLASH_USERDATA_MEM_BASE                        (0x0FE00000UL) /** MSC_FLASH_USERDATA_MEM base address */
#define MSC_FLASH_USERDATA_MEM_SIZE                        (0x00000400UL) /** MSC_FLASH_USERDATA_MEM available address space */
#define MSC_FLASH_USERDATA_MEM_END                         (0x0FE003FFUL) /** MSC_FLASH_USERDATA_MEM end address */
#define MSC_FLASH_USERDATA_MEM_BITS                        (0xBUL)        /** MSC_FLASH_USERDATA_MEM used bits */
#define USERDATA_BASE                                      (0x0FE00000UL) /** USERDATA base address */
#define USERDATA_SIZE                                      (0x00000400UL) /** USERDATA available address space */
#define USERDATA_END                                       (0x0FE003FFUL) /** USERDATA end address */
#define USERDATA_BITS                                      (0xBUL)        /** USERDATA used bits */
#define MSC_FLASH_DEVINFO_MEM_BASE                         (0x0FE08000UL) /** MSC_FLASH_DEVINFO_MEM base address */
#define MSC_FLASH_DEVINFO_MEM_SIZE                         (0x00000400UL) /** MSC_FLASH_DEVINFO_MEM available address space */
#define MSC_FLASH_DEVINFO_MEM_END                          (0x0FE083FFUL) /** MSC_FLASH_DEVINFO_MEM end address */
#define MSC_FLASH_DEVINFO_MEM_BITS                         (0xBUL)        /** MSC_FLASH_DEVINFO_MEM used bits */
#define MSC_FLASH_CHIPCONFIG_MEM_BASE                      (0x0FE08400UL) /** MSC_FLASH_CHIPCONFIG_MEM base address */
#define MSC_FLASH_CHIPCONFIG_MEM_SIZE                      (0x00000600UL) /** MSC_FLASH_CHIPCONFIG_MEM available address space */
#define MSC_FLASH_CHIPCONFIG_MEM_END                       (0x0FE089FFUL) /** MSC_FLASH_CHIPCONFIG_MEM end address */
#define MSC_FLASH_CHIPCONFIG_MEM_BITS                      (0xBUL)        /** MSC_FLASH_CHIPCONFIG_MEM used bits */
#define DMEM_RAM0_RAM_MEM_BASE                             (0x20000000UL) /** DMEM_RAM0_RAM_MEM base address */
#define DMEM_RAM0_RAM_MEM_SIZE                             (0x00080000UL) /** DMEM_RAM0_RAM_MEM available address space */
#define DMEM_RAM0_RAM_MEM_END                              (0x2007FFFFUL) /** DMEM_RAM0_RAM_MEM end address */
#define DMEM_RAM0_RAM_MEM_BITS                             (0x14UL)       /** DMEM_RAM0_RAM_MEM used bits */
#define RAM_MEM_BASE                                       (0x20000000UL) /** RAM_MEM base address */
#define RAM_MEM_SIZE                                       (0x00080000UL) /** RAM_MEM available address space */
#define RAM_MEM_END                                        (0x2007FFFFUL) /** RAM_MEM end address */
#define RAM_MEM_BITS                                       (0x14UL)       /** RAM_MEM used bits */
#define RDMEM_SEQRAM_S_MEM_BASE                            (0xA0000000UL) /** RDMEM_SEQRAM_S_MEM base address */
#define RDMEM_SEQRAM_S_MEM_SIZE                            (0x00006000UL) /** RDMEM_SEQRAM_S_MEM available address space */
#define RDMEM_SEQRAM_S_MEM_END                             (0xA0005FFFUL) /** RDMEM_SEQRAM_S_MEM end address */
#define RDMEM_SEQRAM_S_MEM_BITS                            (0xFUL)        /** RDMEM_SEQRAM_S_MEM used bits */
#define RDMEM_FRCRAM_S_MEM_BASE                            (0xA0006000UL) /** RDMEM_FRCRAM_S_MEM base address */
#define RDMEM_FRCRAM_S_MEM_SIZE                            (0x00001000UL) /** RDMEM_FRCRAM_S_MEM available address space */
#define RDMEM_FRCRAM_S_MEM_END                             (0xA0006FFFUL) /** RDMEM_FRCRAM_S_MEM end address */
#define RDMEM_FRCRAM_S_MEM_BITS                            (0xDUL)        /** RDMEM_FRCRAM_S_MEM used bits */
#define AHBSM_TCM_NEW_MEM_S_MEM_BASE                       (0xA2000000UL) /** AHBSM_TCM_NEW_MEM_S_MEM base address */
#define AHBSM_TCM_NEW_MEM_S_MEM_SIZE                       (0x02000000UL) /** AHBSM_TCM_NEW_MEM_S_MEM available address space */
#define AHBSM_TCM_NEW_MEM_S_MEM_END                        (0xA3FFFFFFUL) /** AHBSM_TCM_NEW_MEM_S_MEM end address */
#define AHBSM_TCM_NEW_MEM_S_MEM_BITS                       (0x1AUL)       /** AHBSM_TCM_NEW_MEM_S_MEM used bits */
#define AHBSM_AHBRAM0_MEM_S_MEM_BASE                       (0xA5000000UL) /** AHBSM_AHBRAM0_MEM_S_MEM base address */
#define AHBSM_AHBRAM0_MEM_S_MEM_SIZE                       (0x00010000UL) /** AHBSM_AHBRAM0_MEM_S_MEM available address space */
#define AHBSM_AHBRAM0_MEM_S_MEM_END                        (0xA500FFFFUL) /** AHBSM_AHBRAM0_MEM_S_MEM end address */
#define AHBSM_AHBRAM0_MEM_S_MEM_BITS                       (0x11UL)       /** AHBSM_AHBRAM0_MEM_S_MEM used bits */
#define AHBROM_RAM0_RAM_S_MEM_BASE                         (0xA6800000UL) /** AHBROM_RAM0_RAM_S_MEM base address */
#define AHBROM_RAM0_RAM_S_MEM_SIZE                         (0x00002000UL) /** AHBROM_RAM0_RAM_S_MEM available address space */
#define AHBROM_RAM0_RAM_S_MEM_END                          (0xA6801FFFUL) /** AHBROM_RAM0_RAM_S_MEM end address */
#define AHBROM_RAM0_RAM_S_MEM_BITS                         (0xEUL)        /** AHBROM_RAM0_RAM_S_MEM used bits */
#define RDMEM_SEQRAM_NS_MEM_BASE                           (0xB0000000UL) /** RDMEM_SEQRAM_NS_MEM base address */
#define RDMEM_SEQRAM_NS_MEM_SIZE                           (0x00006000UL) /** RDMEM_SEQRAM_NS_MEM available address space */
#define RDMEM_SEQRAM_NS_MEM_END                            (0xB0005FFFUL) /** RDMEM_SEQRAM_NS_MEM end address */
#define RDMEM_SEQRAM_NS_MEM_BITS                           (0xFUL)        /** RDMEM_SEQRAM_NS_MEM used bits */
#define RDMEM_SEQRAM_SEQRAM_MEM_BASE                       (0xB0000000UL) /** RDMEM_SEQRAM_SEQRAM_MEM base address */
#define RDMEM_SEQRAM_SEQRAM_MEM_SIZE                       (0x00006000UL) /** RDMEM_SEQRAM_SEQRAM_MEM available address space */
#define RDMEM_SEQRAM_SEQRAM_MEM_END                        (0xB0005FFFUL) /** RDMEM_SEQRAM_SEQRAM_MEM end address */
#define RDMEM_SEQRAM_SEQRAM_MEM_BITS                       (0xFUL)        /** RDMEM_SEQRAM_SEQRAM_MEM used bits */
#define RDMEM_FRCRAM_FRCRAM_MEM_BASE                       (0xB0006000UL) /** RDMEM_FRCRAM_FRCRAM_MEM base address */
#define RDMEM_FRCRAM_FRCRAM_MEM_SIZE                       (0x00001000UL) /** RDMEM_FRCRAM_FRCRAM_MEM available address space */
#define RDMEM_FRCRAM_FRCRAM_MEM_END                        (0xB0006FFFUL) /** RDMEM_FRCRAM_FRCRAM_MEM end address */
#define RDMEM_FRCRAM_FRCRAM_MEM_BITS                       (0xDUL)        /** RDMEM_FRCRAM_FRCRAM_MEM used bits */
#define RDMEM_FRCRAM_NS_MEM_BASE                           (0xB0006000UL) /** RDMEM_FRCRAM_NS_MEM base address */
#define RDMEM_FRCRAM_NS_MEM_SIZE                           (0x00001000UL) /** RDMEM_FRCRAM_NS_MEM available address space */
#define RDMEM_FRCRAM_NS_MEM_END                            (0xB0006FFFUL) /** RDMEM_FRCRAM_NS_MEM end address */
#define RDMEM_FRCRAM_NS_MEM_BITS                           (0xDUL)        /** RDMEM_FRCRAM_NS_MEM used bits */
#define AHBSM_TCM_NEW_MEM_MEM_BASE                         (0xB2000000UL) /** AHBSM_TCM_NEW_MEM_MEM base address */
#define AHBSM_TCM_NEW_MEM_MEM_SIZE                         (0x02000000UL) /** AHBSM_TCM_NEW_MEM_MEM available address space */
#define AHBSM_TCM_NEW_MEM_MEM_END                          (0xB3FFFFFFUL) /** AHBSM_TCM_NEW_MEM_MEM end address */
#define AHBSM_TCM_NEW_MEM_MEM_BITS                         (0x1AUL)       /** AHBSM_TCM_NEW_MEM_MEM used bits */
#define AHBSM_TCM_NEW_MEM_NS_MEM_BASE                      (0xB2000000UL) /** AHBSM_TCM_NEW_MEM_NS_MEM base address */
#define AHBSM_TCM_NEW_MEM_NS_MEM_SIZE                      (0x02000000UL) /** AHBSM_TCM_NEW_MEM_NS_MEM available address space */
#define AHBSM_TCM_NEW_MEM_NS_MEM_END                       (0xB3FFFFFFUL) /** AHBSM_TCM_NEW_MEM_NS_MEM end address */
#define AHBSM_TCM_NEW_MEM_NS_MEM_BITS                      (0x1AUL)       /** AHBSM_TCM_NEW_MEM_NS_MEM used bits */
#define AHBSM_AHBRAM0_MEM_MEM_BASE                         (0xB5000000UL) /** AHBSM_AHBRAM0_MEM_MEM base address */
#define AHBSM_AHBRAM0_MEM_MEM_SIZE                         (0x00010000UL) /** AHBSM_AHBRAM0_MEM_MEM available address space */
#define AHBSM_AHBRAM0_MEM_MEM_END                          (0xB500FFFFUL) /** AHBSM_AHBRAM0_MEM_MEM end address */
#define AHBSM_AHBRAM0_MEM_MEM_BITS                         (0x11UL)       /** AHBSM_AHBRAM0_MEM_MEM used bits */
#define AHBSM_AHBRAM0_MEM_NS_MEM_BASE                      (0xB5000000UL) /** AHBSM_AHBRAM0_MEM_NS_MEM base address */
#define AHBSM_AHBRAM0_MEM_NS_MEM_SIZE                      (0x00010000UL) /** AHBSM_AHBRAM0_MEM_NS_MEM available address space */
#define AHBSM_AHBRAM0_MEM_NS_MEM_END                       (0xB500FFFFUL) /** AHBSM_AHBRAM0_MEM_NS_MEM end address */
#define AHBSM_AHBRAM0_MEM_NS_MEM_BITS                      (0x11UL)       /** AHBSM_AHBRAM0_MEM_NS_MEM used bits */
#define AHBROM_RAM0_RAM_MEM_BASE                           (0xB6800000UL) /** AHBROM_RAM0_RAM_MEM base address */
#define AHBROM_RAM0_RAM_MEM_SIZE                           (0x00002000UL) /** AHBROM_RAM0_RAM_MEM available address space */
#define AHBROM_RAM0_RAM_MEM_END                            (0xB6801FFFUL) /** AHBROM_RAM0_RAM_MEM end address */
#define AHBROM_RAM0_RAM_MEM_BITS                           (0xEUL)        /** AHBROM_RAM0_RAM_MEM used bits */
#define AHBROM_RAM0_RAM_NS_MEM_BASE                        (0xB6800000UL) /** AHBROM_RAM0_RAM_NS_MEM base address */
#define AHBROM_RAM0_RAM_NS_MEM_SIZE                        (0x00002000UL) /** AHBROM_RAM0_RAM_NS_MEM available address space */
#define AHBROM_RAM0_RAM_NS_MEM_END                         (0xB6801FFFUL) /** AHBROM_RAM0_RAM_NS_MEM end address */
#define AHBROM_RAM0_RAM_NS_MEM_BITS                        (0xEUL)        /** AHBROM_RAM0_RAM_NS_MEM used bits */

